posts/2021年终总结.org
#+TITLE: 2021年终总结
#+SLUG: 2021年终总结
#+DATE:<2021-12-31>
#+OPTIONS: toc:nil num:nil
#+FILETAGS: :blogging:

* 2021年终总结
2021年接近尾声了,总结下这一年做了哪些事情：
** 专业技能
这年主要看了三本比较好的专业书籍分别是：
大话存储2：这本书是存储行业入门必看书籍，书籍涉猎也比较全，从磁盘结构，到存储系统设计，各个方面都有介绍，并且十分详尽。
Pro Git : 这本书也是一本工具书，git必备工具书。
第一本Docker:项目中开始越来越多使用docker，无论从项目构建，测试，以及生产环境，都有docker身影，所以docker也是程序员
             必须要掌握的技能。这本书从docker使用开始入手，深入浅出非常适合入门，目前还在阅读中。

** 源码学习
程序员应该需要不断的阅读理解好的源码，这样能够提高本省的编程水平。今年主要看的开源源码如下:
1. linux kernel ext2 filesystem 学习，囫囵吞枣把源码看了一遍，后续有空还会二刷；
2. emacs lisp plugin 相关source code学习：看了ag-mode/launch-app, 看emacs plugin source code有助于更好使用emacs。


** 健身
随着年龄增大，身体越来越需要通过锻炼来保证在比较好的状态，过去的一年，每天几乎可以完成徒步1w步，另外还完成1月的fitness计划，
中间由于腰痛，没有继续坚持下去。

** 展望2022
*** 工作相关
快速熟悉新平台，能够在新平台上完成新功能开发，更深入了解新平台整个架构。
*** 开源相关
有闲暇时间，继续学习linux 内核，更深入了解linux 文件系统，进而继续了解linux内核其他模块

更加深入精读一些emacs plugin source code，争取能够为一些开源plugin发一些patch。
*** 健身方面
希望继续保持好的健身计划，并且规划些适合自己的健身计划，同时能够影响自己的亲人一起进行健身。

希望新的一年，读更多好书，看更多源码，也祝愿自己亲人身体健康。


