blog/2021年终总结.html

<!doctype html>
<html lang="en-us">
  <head>
    <meta charset="utf-8">
    <title>robin2003 &mdash; Home</title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="stylesheet" type="text/css" href="/media/css/main.css">
    <link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css">
    <link rel="alternate" type="application/rss+xml" href="/blog/rss.xml">
  </head>
  <body>
    
      <div class="social">
        <div class="container">
          <ul class="badges">
            <li>
              <a href="mailto:xxpyb@126.com" alt="Email">
                <span class="fa fa-envelope-o"></span>EMail
              </a>
            </li>
            <li>
              <a href="https://github.com/robin2003" target="_blank" alt="Github">
                <span class="fa fa-github-alt"></span>Github
              </a>
            </li>
            <li>
              <a href="/blog/rss.xml" alt="RSS">
                <span class="fa fa-rss"></span>RSS
              </a>
            </li>
          </ul>

          <a href="/" alt="robin2003">
          </a>
        </div>
      </div>
    

    <div class="post">
      <div class="container">
        
  <!-- 2021年终总结 -->
  
  <div class="title">
    <h1>2021年终总结</h1>
    <span class="pubdate">Dec 31, 2021</span>
  </div>

  
  <div class="content">
    
<div id="outline-container-2021年终总结" class="outline-2">
<h2 id="2021年终总结">2021年终总结</h2>
<div class="outline-text-2">
<p>
2021年接近尾声了,总结下这一年做了哪些事情：
</p>
</div>
<div id="outline-container-专业技能" class="outline-3">
<h3 id="专业技能">专业技能</h3>
<div class="outline-text-3">
<p>
这年主要看了三本比较好的专业书籍分别是：
大话存储2：这本书是存储行业入门必看书籍，书籍涉猎也比较全，从磁盘结构，到存储系统设计，各个方面都有介绍，并且十分详尽。
Pro Git : 这本书也是一本工具书，git必备工具书。
第一本Docker:项目中开始越来越多使用docker，无论从项目构建，测试，以及生产环境，都有docker身影，所以docker也是程序员
             必须要掌握的技能。这本书从docker使用开始入手，深入浅出非常适合入门，目前还在阅读中。
</p>
</div>
</div>

<div id="outline-container-源码学习" class="outline-3">
<h3 id="源码学习">源码学习</h3>
<div class="outline-text-3">
<p>
程序员应该需要不断的阅读理解好的源码，这样能够提高本省的编程水平。今年主要看的开源源码如下:
</p>
<ol class="org-ol">
<li>linux kernel ext2 filesystem 学习，囫囵吞枣把源码看了一遍，后续有空还会二刷；</li>
<li>emacs lisp plugin 相关source code学习：看了ag-mode/launch-app, 看emacs plugin source code有助于更好使用emacs。</li>
</ol>
</div>
</div>


<div id="outline-container-健身" class="outline-3">
<h3 id="健身">健身</h3>
<div class="outline-text-3">
<p>
随着年龄增大，身体越来越需要通过锻炼来保证在比较好的状态，过去的一年，每天几乎可以完成徒步1w步，另外还完成1月的fitness计划，
中间由于腰痛，没有继续坚持下去。
</p>
</div>
</div>

<div id="outline-container-展望2022" class="outline-3">
<h3 id="展望2022">展望2022</h3>
<div class="outline-text-3" id="text-展望2022">
</div>
<div id="outline-container-工作相关" class="outline-4">
<h4 id="工作相关">工作相关</h4>
<div class="outline-text-4">
<p>
快速熟悉新平台，能够在新平台上完成新功能开发，更深入了解新平台整个架构。
</p>
</div>
</div>
<div id="outline-container-开源相关" class="outline-4">
<h4 id="开源相关">开源相关</h4>
<div class="outline-text-4">
<p>
有闲暇时间，继续学习linux 内核，更深入了解linux 文件系统，进而继续了解linux内核其他模块
</p>

<p>
更加深入精读一些emacs plugin source code，争取能够为一些开源plugin发一些patch。
</p>
</div>
</div>
<div id="outline-container-健身方面" class="outline-4">
<h4 id="健身方面">健身方面</h4>
<div class="outline-text-4">
<p>
希望继续保持好的健身计划，并且规划些适合自己的健身计划，同时能够影响自己的亲人一起进行健身。
</p>

<p>
希望新的一年，读更多好书，看更多源码，也祝愿自己亲人身体健康。
</p>
</div>
</div>
</div>
</div>

  </div>

      </div>
    </div>
  </body>
</html>
